Catalogs/ЦветаРАЛ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЦветаРАЛ</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодКрасный</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСиний</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодЗеленый</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипRAL</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыRAL</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ЦветаРАЛ/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура УстановитьОформление(тзЦвета)
	ЭтаФорма.УсловноеОформление.Элементы.Очистить();
	БелыйЦвет = Новый Цвет(255,255,255);
	ЧерныйЦвет =  Новый Цвет(0,0,0);
	Для каждого х Из тзЦвета Цикл
		ЭлементОформления = Список.УсловноеОформление.Элементы.Добавить();
		ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КодКрасный");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = х.КодКрасный;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КодЗеленый");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение= х.КодЗеленый;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КодСиний");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = х.КодСиний;
		ЭлементОтбора.Использование = Истина;
		
		Элемент = ЭлементОформления.Оформление.Элементы[1];
		Элемент.Использование = Истина;
		Элемент.Значение = ?(х.КодКрасный+х.КодЗеленый+х.КодСиний < 384, БелыйЦвет, ЧерныйЦвет);
		Элемент = ЭлементОформления.Оформление.Элементы[0];
		Элемент.Использование = Истина;
		Элемент.Значение = Новый Цвет(х.КодКрасный,х.КодЗеленый,х.КодСиний);
		
		
	КонецЦикла; 		
	
КонецПроцедуры // УстановитьОформление()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	 УстановитьОформление(ПолучитьВсеЦвета());
КонецПроцедуры

&НаСервере
Функция ПолучитьВсеЦвета()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	IsNull(ЦветаРАЛ.КодКрасный,0) КАК КодКрасный,
		|	IsNull(ЦветаРАЛ.КодСиний,0) КАК КодСиний,
		|	IsNull(ЦветаРАЛ.КодЗеленый,0) КАК КодЗеленый
		|ИЗ
		|	Справочник.ЦветаРАЛ КАК ЦветаРАЛ
		|ГДЕ
		|	ЦветаРАЛ.ЭтоГруппа = ЛОЖЬ";
	
	Возврат Запрос.Выполнить().Выгрузить();
	

КонецФункции // ПолучитьВсеЦвета()
